#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.sops_file.secrets: Reading...
data.sops_file.argocd-chart-values: Reading...
data.sops_file.base-chart-values: Reading...
data.sops_file.argocd-chart-values: Read complete after 0s [id=-]
data.sops_file.base-chart-values: Read complete after 0s [id=-]
data.sops_file.secrets: Read complete after 0s [id=-]
argocd_repository.oci-ghcr: Refreshing state... [id=ghcr.io/actions/actions-runner-controller-charts]
argocd_repository.infra-git: Refreshing state... [id=git@github.com:unerror/infra.git]
argocd_repository.oci-dockerhub: Refreshing state... [id=registry-1.docker.io/casbin]
argocd_application.vaultwarden: Refreshing state... [id=vaultwarden:default]
data.digitalocean_project.unerror-network: Reading...
digitalocean_vpc.kubernetes-tor1: Refreshing state... [id=4a6b39e4-844d-4ccf-bb0f-9f71ae432afd]
data.digitalocean_kubernetes_versions.latest: Reading...
digitalocean_spaces_bucket.signoz-storage: Refreshing state... [id=unenet-signoz-storage]
digitalocean_database_cluster.db-tor1: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c]
digitalocean_database_user.users["casdoor"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/user/casdoor]
digitalocean_database_user.users["homeassistant"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/user/homeassistant]
digitalocean_database_user.users["matrix"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/user/matrix]
digitalocean_database_db.dbs["matrix_appservice_irc"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/matrix_appservice_irc]
digitalocean_database_user.users["vaultwarden"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/user/vaultwarden]
digitalocean_database_db.dbs["matrix_ma1sd"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/matrix_ma1sd]
digitalocean_database_user.users["discourse"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/user/discourse]
digitalocean_database_db.dbs["casdoor"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/casdoor]
data.digitalocean_kubernetes_versions.latest: Read complete after 1s [id=terraform-20240705133610258000000001]
digitalocean_database_db.dbs["homeserver_synapse"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/homeserver_synapse]
digitalocean_database_db.dbs["matrix_mautrix_hangouts"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/matrix_mautrix_hangouts]
digitalocean_database_db.dbs["matrix_reminder_bot"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/matrix_reminder_bot]
digitalocean_database_db.dbs["discourse"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/discourse]
digitalocean_database_db.dbs["sliding_sync_proxy"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/sliding_sync_proxy]
digitalocean_database_db.dbs["vaultwarden"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/vaultwarden]
digitalocean_database_db.dbs["matrix_dimension"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/database/matrix_dimension]
digitalocean_kubernetes_cluster.une-k8s: Refreshing state... [id=3ea2f22c-674c-4fa4-94d9-509168a2c5bb]
digitalocean_database_firewall.firewall: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c-20230214154213473500000001]
kubernetes_secret.dockerlogin: Refreshing state... [id=default/do-docker-registry]
kubernetes_secret.ghcr-login: Refreshing state... [id=default/ghcr-registry]
kubernetes_secret.name: Refreshing state... [id=default/age-keyfile]
kubernetes_namespace.une-sys: Refreshing state... [id=une-sys]
argocd_project.infra: Refreshing state... [id=infra]
helm_release.base: Refreshing state... [id=base]
digitalocean_database_connection_pool.pools["matrix_reminder_bot"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/matrix_reminder_bot]
digitalocean_database_connection_pool.pools["vaultwarden"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/vaultwarden]
digitalocean_database_connection_pool.pools["casdoor"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/casdoor]
digitalocean_database_connection_pool.pools["matrix_mautrix_hangouts"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/matrix_mautrix_hangouts]
digitalocean_database_connection_pool.pools["matrix_dimension"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/matrix_dimension]
digitalocean_database_connection_pool.pools["discourse"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/discourse]
digitalocean_database_connection_pool.pools["matrix_appservice_irc"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/matrix_appservice_irc]
digitalocean_database_connection_pool.pools["sliding_sync_proxy"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/sliding_sync_proxy]
digitalocean_database_connection_pool.pools["matrix_ma1sd"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/matrix_ma1sd]
digitalocean_database_connection_pool.pools["homeserver_synapse"]: Refreshing state... [id=34f40f9d-4c2a-4efd-a740-a3961f34457c/homeserver_synapse]
data.digitalocean_project.unerror-network: Read complete after 5s [id=a4076b3f-f3f3-4fb4-a799-6e763bb75942]
digitalocean_project_resources.une-k8s-unerror-network: Refreshing state... [id=a4076b3f-f3f3-4fb4-a799-6e763bb75942]
time_sleep.base-chart-install: Refreshing state... [id=2021-09-30T14:13:16Z]
helm_release.certs: Refreshing state... [id=certs]
helm_release.argocd: Refreshing state... [id=argocd]
argocd_application.certs: Refreshing state... [id=certs:default]
argocd_application.csi-s3: Refreshing state... [id=csi-s3:default]
argocd_application.base: Refreshing state... [id=base:default]
argocd_application.networking: Refreshing state... [id=networking:default]
argocd_application.chatbox: Refreshing state... [id=chatbox:default]
argocd_application.argocd: Refreshing state... [id=argocd:default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # argocd_application.monitoring will be created
  + resource "argocd_application" "monitoring" {
      + cascade = true
      + id      = (known after apply)
      + status  = (known after apply)
      + wait    = true

      + metadata {
          + generation       = (known after apply)
          + name             = "monitoring"
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "infra"
          + revision_history_limit = 10

          + destination {
              + namespace = "une-sys"
              + server    = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "charts/coroot"
              + repo_url        = "git@github.com:unerror/infra.git"
              + target_revision = "HEAD"

              + helm {
                  + value_files = [
                      + "values.yaml",
                    ]
                }
            }

          + sync_policy {
              + automated {
                  + allow_empty = false
                  + prune       = true
                  + self_heal   = true
                }
            }
        }
    }

  # digitalocean_spaces_bucket.signoz-storage will be destroyed
  # (because digitalocean_spaces_bucket.signoz-storage is not in configuration)
  - resource "digitalocean_spaces_bucket" "signoz-storage" {
      - acl                = "private" -> null
      - bucket_domain_name = "unenet-signoz-storage.nyc3.digitaloceanspaces.com" -> null
      - endpoint           = "nyc3.digitaloceanspaces.com" -> null
      - force_destroy      = false -> null
      - id                 = "unenet-signoz-storage" -> null
      - name               = "unenet-signoz-storage" -> null
      - region             = "nyc3" -> null
      - urn                = "do:space:unenet-signoz-storage" -> null

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 1 -> null
          - enabled                                = true -> null
          - id                                     = "delete-objects-after-30-days" -> null

          - expiration {
              - days                         = 30 -> null
              - expired_object_delete_marker = false -> null
            }

          - noncurrent_version_expiration {
              - days = 5 -> null
            }
        }

      - versioning {
          - enabled = true -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @enmand, Action: `pull_request`*